% Последовательность Баркера-2
barker2 = [1 -1];

% Последовательность Баркера-3
barker3 = [1 1 -1];

% Последовательность Баркера-4
barker4 = [1 1 1 -1];

% Последовательность Баркера-5
barker5 = [1 1 1 -1 1];

% Последовательность Баркера-7
barker7 = [1 1 1 -1 -1 1 -1];

% Последовательность Баркера-11
barker11 = [1 1 1 -1 -1 -1 1 1 -1 1 -1];

% Последовательность Баркера-13
barker13 = [1 1 1 1 1 -1 -1 1 1 -1 1 -1 1];

% Последовательность Баркера-17
barker17 = [1 1 1 1 1 -1 -1 1 1 -1 -1 1 -1 1 -1 -1 1];

% Последовательность Баркера-23
barker23 = [1 1 1 1 1 -1 -1 1 1 -1 -1 -1 1 1 -1 1 -1 1 -1 -1 1 -1 1];

% Последовательность Баркера-29
barker29 = [1 1 1 1 1 -1 -1 1 1 -1 -1 -1 1 1 -1 -1 -1 1 -1 -1 -1 1 -1 1 -1 -1 -1 1];

